#### Preparing Mexico Data

In [236]:
import pandas as pd

In [237]:
df1 =pd.read_csv("mexico-real-estate-1.csv")
df2 =pd.read_csv("mexico-real-estate-2.csv")
df3 =pd.read_csv("mexico-real-estate-3.csv")

##### Clean df1

In [238]:
df1.shape

(700, 6)

In [239]:
### 700 observation and 6 features

In [240]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    float64
 5   price_usd      700 non-null    object
dtypes: float64(3), object(3)
memory usage: 32.9+ KB

In [241]:
df1.head()

,property_type,state,lat,lon,area_m2,price_usd
0,house,Estado de México,19.560181,-99.233528,150.0,"$67,965.56"
1,house,Nuevo León,25.688436,-100.198807,186.0,"$63,223.78"
2,apartment,Guerrero,16.767704,-99.764383,82.0,"$84,298.37"
3,apartment,Guerrero,16.829782,-99.911012,150.0,"$94,308.80"
4,house,Veracruz de Ignacio de la Llave,NaN,NaN,175.0,"$94,835.67"

In [242]:
## problem 
# 1. The dataset contains missing (null) values.

# 2. The price_usd column is stored as a string, but 
# it should be converted to a float for proper numerical analysis.

# 3 The price_usd values include special characters ($ and ,) 
# that need to be removed before converting the column to floats.

In [243]:
## Solution of problem 1
## remove NaN value
df1.dropna(inplace=True)

In [244]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 583 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  583 non-null    object
 1   state          583 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        583 non-null    float64
 5   price_usd      583 non-null    object
dtypes: float64(3), object(3)
memory usage: 31.9+ KB

In [245]:
## solution of problem 2 and 3
df1["price_usd"]= (
    df1["price_usd"]
    .str.replace("$","",regex=False)
    .str.replace(",","")
    .astype(float))

In [246]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 583 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  583 non-null    object
 1   state          583 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        583 non-null    float64
 5   price_usd      583 non-null    float64
dtypes: float64(4), object(2)
memory usage: 31.9+ KB

##### Clean df2

In [247]:
df2.shape

(700, 6)

In [248]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            571 non-null    float64
 3   lon            571 non-null    float64
 4   area_m2        700 non-null    float64
 5   price_mxn      700 non-null    float64
dtypes: float64(4), object(2)
memory usage: 32.9+ KB

In [249]:
df2.head()

  property_type       state        lat         lon  area_m2  price_mxn
0     apartment  Nuevo León  25.721081 -100.345581     72.0  1300000.0
1     apartment      Puebla        NaN         NaN    190.0  2500000.0
2         house     Morelos  23.634501 -102.552788    360.0  5300000.0
3         house     Morelos        NaN         NaN     76.0   820000.0
4         house      Puebla        NaN         NaN    200.0  1100000.0

In [250]:
## problem
# 1. The dataset contains some missing values.

# 2. The price column is currently in MXN (Mexican Pesos), but it should be converted to USD.

In [251]:
## solution
# problem 1
df2.dropna(inplace=True)

In [252]:
## problem 2
df2["price_usd"]=(df2["price_mxn"] / 19).round(2)
df2.head()

,property_type,state,lat,lon,area_m2,price_mxn,price_usd
0,apartment,Nuevo León,25.721081,-100.345581,72.0,1300000.0,68421.05
2,house,Morelos,23.634501,-102.552788,360.0,5300000.0,278947.37
6,apartment,Estado de México,19.272040,-99.572013,85.0,1250000.0,65789.47
7,house,San Luis Potosí,22.138882,-100.996510,158.0,2120000.0,111578.95
8,apartment,Distrito Federal,19.394558,-99.129707,65.0,758190.0,39904.74

In [253]:
## we need to drop price_mxn column
df2.drop(columns=["price_mxn"],inplace=True)
df2.head()

  property_type             state        lat         lon  area_m2  price_usd
0     apartment        Nuevo León  25.721081 -100.345581     72.0   68421.05
2         house           Morelos  23.634501 -102.552788    360.0  278947.37
6     apartment  Estado de México  19.272040  -99.572013     85.0   65789.47
7         house   San Luis Potosí  22.138882 -100.996510    158.0  111578.95
8     apartment  Distrito Federal  19.394558  -99.129707     65.0   39904.74

##### clean df3

In [254]:
df3.shape

(700, 5)

In [255]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            700 non-null    object
 1   place_with_parent_names  700 non-null    object
 2   lat-lon                  582 non-null    object
 3   area_m2                  700 non-null    float64
 4   price_usd                700 non-null    float64
dtypes: float64(2), object(3)
memory usage: 27.5+ KB

In [256]:
## problem
## 1. The dataset contains NaN (missing) values.

## 2. Latitude and longitude are stored together in a single column, 
# but they should be separated into two distinct columns (lat and lon).

## 3. The place column includes the parent’s name along with the location, 
# but we only need the state name extracted.

In [257]:
## solution
# problem 1
df3.dropna(inplace=True)

In [258]:
df3["lat-lon"].head()

0       19.52589,-99.151703
1    19.2640539,-99.5727534
2      19.268629,-99.671722
4      19.511938,-96.871956
5     20.689157,-103.366728
Name: lat-lon, dtype: object

In [259]:
df3[["lat", "lon"]] = df3["lat-lon"].str.split(",", expand=True)

In [260]:
df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd,lat,lon
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71.0,48550.59,19.52589,-99.151703
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233.0,168636.73,19.2640539,-99.5727534
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300.0,86932.69,19.268629,-99.671722
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84.0,68508.67,19.511938,-96.871956
5,house,|México|Jalisco|Guadalajara|,"20.689157,-103.366728",175.0,102763.00,20.689157,-103.366728

In [261]:
df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd,lat,lon
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71.0,48550.59,19.52589,-99.151703
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233.0,168636.73,19.2640539,-99.5727534
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300.0,86932.69,19.268629,-99.671722
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84.0,68508.67,19.511938,-96.871956
5,house,|México|Jalisco|Guadalajara|,"20.689157,-103.366728",175.0,102763.00,20.689157,-103.366728

In [262]:
## problem 3
df3["place_with_parent_names"].head()

0    |México|Distrito Federal|Gustavo A. Madero|Acu...
1             |México|Estado de México|Toluca|Metepec|
2    |México|Estado de México|Toluca|Toluca de Lerd...
4    |México|Veracruz de Ignacio de la Llave|Veracruz|
5                         |México|Jalisco|Guadalajara|
Name: place_with_parent_names, dtype: object

In [263]:
df3["state"]=df3["place_with_parent_names"].str.split("|",expand=True)[2]

In [264]:
df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd,lat,lon,state
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71.0,48550.59,19.52589,-99.151703,Distrito Federal
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233.0,168636.73,19.2640539,-99.5727534,Estado de México
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300.0,86932.69,19.268629,-99.671722,Estado de México
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84.0,68508.67,19.511938,-96.871956,Veracruz de Ignacio de la Llave
5,house,|México|Jalisco|Guadalajara|,"20.689157,-103.366728",175.0,102763.00,20.689157,-103.366728,Jalisco

In [266]:
# drop place_with_parent_names and lat -lon columns
df3.drop(columns=["place_with_parent_names","lat-lon"],inplace=True)

In [267]:
df3.head()

,property_type,area_m2,price_usd,lat,lon,state
0,apartment,71.0,48550.59,19.52589,-99.151703,Distrito Federal
1,house,233.0,168636.73,19.2640539,-99.5727534,Estado de México
2,house,300.0,86932.69,19.268629,-99.671722,Estado de México
4,apartment,84.0,68508.67,19.511938,-96.871956,Veracruz de Ignacio de la Llave
5,house,175.0,102763.00,20.689157,-103.366728,Jalisco

##### Concatenate DataFrames¶

In [268]:
df =pd.concat([df1,df2,df3])
print(df.shape)
df.head()

(1736, 6)

  property_type             state        lat         lon  area_m2  price_usd
0         house  Estado de México  19.560181  -99.233528    150.0   67965.56
1         house        Nuevo León  25.688436 -100.198807    186.0   63223.78
2     apartment          Guerrero  16.767704  -99.764383     82.0   84298.37
3     apartment          Guerrero  16.829782  -99.911012    150.0   94308.80
5         house           Yucatán  21.052583  -89.538639    205.0  105191.37

##### Save df

In [269]:
df.to_csv("mexico-real-estate-clean.csv",index=False)